spec/fixtures/stripe/invoice_created.json

{
  "id": "evt_00000000000001",
  "object": "event",
  "api_version": "2017-05-25",
  "created": 1326853478,
  "data": {
    "object": {
      "id": "in_1APVed2eZvKYlo2CP6dsoJTo",
      "created": 1326853478,
      "object": "invoice",
      "amount_due": 599,
      "application_fee": "null",
      "attempt_count": 1,
      "attempted": true,
      "charge": "ch_1APVed2eZvKYlo2C1QNH6jru",
      "closed": true,
      "currency": "gbp",
      "customer": "cus_12345667",
      "date": 1496232623,
      "description": "null",
      "discount": "null",
      "ending_balance": 0,
      "forgiven": false,
      "lines": {
        "data": [
          {
            "id": "li_dfsafadsfasfdfasf",
            "object": "line_item",
            "amount": 599,
            "currency": "gbp",
            "description": "null",
            "discountable": true,
            "livemode": true,
            "metadata": {},
            "period": {
              "start": 1498824623,
              "end": 1501503023
            },
            "plan": {
              "id": "plan_dfsafadsfasfdfasf",
              "object": "plan",
              "amount": 999,
              "created": 1496222010,
              "currency": "gbp",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {},
              "name": "plan name",
              "statement_descriptor": "null",
              "trial_period_days": "null"
            },
            "proration": false,
            "quantity": 1,
            "subscription": "null",
            "subscription_item": "si_1APVed2eZvKYlo2C387JnMRE",
            "type": "subscription"
          }
        ],
        "total_count": 1,
        "object": "list",
        "url": "/v1/invoices/in_1APVed2eZvKYlo2CP6dsoJTo/lines"
      },
      "livemode": false,
      "metadata": {},
      "next_payment_attempt": 1326853478,
      "paid": true,
      "period_end": 1496232623,
      "period_start": 1496232623,
      "receipt_number": "null",
      "starting_balance": 0,
      "statement_descriptor": "null",
      "subscription": "sub_324rdsfgdg4rt4",
      "subtotal": 599,
      "tax": "null",
      "tax_percent": "null",
      "total": 599,
      "webhooks_delivered_at": 1496232630
    }
  },
  "livemode": false,
  "pending_webhooks": 1,
  "request": "req_Al1inviVvNH7df",
  "type": "invoice.created"
}
